In [9]:
import numpy as np
import pandas as pd

In [10]:
!wget http://mtg.upf.edu/static/datasets/last.fm/lastfm-dataset-1K.tar.gz

--2022-02-04 07:44:44--  http://mtg.upf.edu/static/datasets/last.fm/lastfm-dataset-1K.tar.gz
Resolvendo mtg.upf.edu (mtg.upf.edu)... 84.89.139.55
Conectando-se a mtg.upf.edu (mtg.upf.edu)|84.89.139.55|:80... conectado.
A requisição HTTP foi enviada, aguardando resposta... 200 OK
Tamanho: 672741554 (642M) [application/x-gzip]
Salvando em: “lastfm-dataset-1K.tar.gz”

lastfm-dataset-1K.t 100%[===================>] 641,58M   879KB/s    em 35m 9s

2022-02-04 08:19:54 (311 KB/s) - “lastfm-dataset-1K.tar.gz” salvo [672741554/672741554]

In [16]:
!ls

'Ações do PySpark – Exemplo completo.ipynb'
 basic_data_exploration_user_profile.ipynb
 data_exploration_play_counts.ipynb
 DataFrame_Basics.ipynb
'Exemplo completo de transformações PySpark RDD.ipynb'
'Exemplo de ações do PySpark RDD.ipynb'
'Exemplos de funções de PairRDDFunctions .ipynb'
 lastfm-dataset-1K
 lastfm-dataset-1K.tar.gz
 people.json
 people.txt
'PySpark DataFrame.ipynb'
'PySpark RDD .ipynb'
 README.md
 recommendation_engine.ipynb
 test.txt

In [17]:
!tar -xvzf lastfm-dataset-1K.tar.gz

lastfm-dataset-1K/
lastfm-dataset-1K/userid-profile.tsv
lastfm-dataset-1K/README.txt
lastfm-dataset-1K/userid-timestamp-artid-artname-traid-traname.tsv

In [18]:
!ls

'Ações do PySpark – Exemplo completo.ipynb'
 basic_data_exploration_user_profile.ipynb
 data_exploration_play_counts.ipynb
 DataFrame_Basics.ipynb
'Exemplo completo de transformações PySpark RDD.ipynb'
'Exemplo de ações do PySpark RDD.ipynb'
'Exemplos de funções de PairRDDFunctions .ipynb'
 lastfm-dataset-1K
 lastfm-dataset-1K.tar.gz
 people.json
 people.txt
'PySpark DataFrame.ipynb'
'PySpark RDD .ipynb'
 README.md
 recommendation_engine.ipynb
 test.txt

In [19]:
user_profile = pd.read_csv('lastfm-dataset-1K/userid-profile.tsv',sep='\t')

In [20]:
user_profile.head()

           #id gender   age        country    registered
0  user_000001      m   NaN          Japan  Aug 13, 2006
1  user_000002      f   NaN           Peru  Feb 24, 2006
2  user_000003      m  22.0  United States  Oct 30, 2005
3  user_000004      f   NaN            NaN  Apr 26, 2006
4  user_000005      m   NaN       Bulgaria  Jun 29, 2006

In [21]:
user_profile.columns

Index(['#id', 'gender', 'age', 'country', 'registered'], dtype='object')

In [22]:
user_profile['age'].max()

103.0

In [23]:
user_profile.describe()

              age
count  286.000000
mean    25.367133
std      8.314952
min      3.000000
25%     21.000000
50%     23.000000
75%     28.000000
max    103.000000

In [24]:
user_profile.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 992 entries, 0 to 991
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   #id         992 non-null    object
 1   gender      884 non-null    object
 2   age         286 non-null    float64
 3   country     907 non-null    object
 4   registered  984 non-null    object
dtypes: float64(1), object(4)
memory usage: 38.9+ KB

In [25]:
user_profile['gender'].value_counts()

m    502
f    382
Name: gender, dtype: int64

In [26]:
user_profile['country'].value_counts()

United States             228
United Kingdom            126
Poland                     50
Germany                    36
Norway                     35
                         ...
Zimbabwe                    1
Bosnia and Herzegovina      1
Nicaragua                   1
Algeria                     1
Iceland                     1
Name: country, Length: 66, dtype: int64

In [27]:
user_profile['registered'].value_counts()

Dec 6, 2005     6
Apr 18, 2006    5
Jun 3, 2006     5
Mar 5, 2006     5
Dec 4, 2005     5
               ..
Dec 30, 2005    1
Jul 18, 2007    1
Jul 11, 2006    1
Feb 8, 2007     1
Dec 20, 2004    1
Name: registered, Length: 625, dtype: int64

In [32]:
!wget http://mtg.upf.edu/static/datasets/last.fm/lastfm-dataset-360K.tar.gz

--2022-02-04 08:23:18--  http://mtg.upf.edu/static/datasets/last.fm/lastfm-dataset-360K.tar.gz
Resolvendo mtg.upf.edu (mtg.upf.edu)... 84.89.139.55
Conectando-se a mtg.upf.edu (mtg.upf.edu)|84.89.139.55|:80... conectado.
A requisição HTTP foi enviada, aguardando resposta... 200 OK
Tamanho: 569202935 (543M) [application/x-gzip]
Salvando em: “lastfm-dataset-360K.tar.gz”

lastfm-dataset-360K 100%[===================>] 542,83M   221KB/s    em 84m 48s

2022-02-04 09:48:07 (109 KB/s) - “lastfm-dataset-360K.tar.gz” salvo [569202935/569202935]

In [33]:
!ls

'Ações do PySpark – Exemplo completo.ipynb'
 basic_data_exploration_user_profile.ipynb
 data_exploration_play_counts.ipynb
 DataFrame_Basics.ipynb
'Exemplo completo de transformações PySpark RDD.ipynb'
'Exemplo de ações do PySpark RDD.ipynb'
'Exemplos de funções de PairRDDFunctions .ipynb'
 lastfm-dataset-1K
 lastfm-dataset-1K.tar.gz
 lastfm-dataset-360K.tar.gz
 people.json
 people.txt
'PySpark DataFrame.ipynb'
'PySpark RDD .ipynb'
 README.md
 recommendation_engine.ipynb
 test.txt

In [49]:
!tar -xvzf lastfm-dataset-360K.tar.gz

lastfm-dataset-360K/
lastfm-dataset-360K/usersha1-artmbid-artname-plays.tsv
lastfm-dataset-360K/README.txt
lastfm-dataset-360K/mbox_sha1sum.py
lastfm-dataset-360K/usersha1-profile.tsv

In [50]:
!ls

'Ações do PySpark – Exemplo completo.ipynb'
 basic_data_exploration_user_profile.ipynb
 data_exploration_play_counts.ipynb
 DataFrame_Basics.ipynb
'Exemplo completo de transformações PySpark RDD.ipynb'
'Exemplo de ações do PySpark RDD.ipynb'
'Exemplos de funções de PairRDDFunctions .ipynb'
 lastfm-dataset-1K
 lastfm-dataset-1K.tar.gz
 lastfm-dataset-360K
 lastfm-dataset-360K.tar.gz
 people.json
 people.txt
'PySpark DataFrame.ipynb'
'PySpark RDD .ipynb'
 README.md
 recommendation_engine.ipynb
 test.txt

In [68]:
user2_profile = pd.read_csv('lastfm-dataset-360K/usersha1-profile.tsv',sep='\t')

In [69]:
user2_profile.head()

,00000c289a1829a808ac09c00daf10bc3c4e223b,f,22,Germany,"Feb 1, 2007"
0,00001411dc427966b17297bf4d69e7e193135d89,f,NaN,Canada,"Dec 4, 2007"
1,00004d2ac9316e22dc007ab2243d6fcb239e707d,NaN,NaN,Germany,"Sep 1, 2006"
2,000063d3fe1cf2ba248b9e3c3f0334845a27a6bf,m,19.0,Mexico,"Apr 28, 2008"
3,00007a47085b9aab8af55f52ec8846ac479ac4fe,m,28.0,United States,"Jan 27, 2006"
4,0000c176103e538d5c9828e695fed4f7ae42dd01,m,20.0,United Kingdom,"Jan 14, 2006"

In [70]:
user2_profile.columns

Index(['00000c289a1829a808ac09c00daf10bc3c4e223b', 'f', '22', 'Germany',
       'Feb 1, 2007'],
      dtype='object')

In [73]:
user2_profile.describe()

                  22
count  284446.000000
mean       25.098057
std        21.665779
min     -1337.000000
25%        20.000000
50%        23.000000
75%        28.000000
max      1002.000000

In [74]:
user2_profile.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359346 entries, 0 to 359345
Data columns (total 5 columns):
 #   Column                                    Non-Null Count   Dtype
---  ------                                    --------------   -----
 0   00000c289a1829a808ac09c00daf10bc3c4e223b  359346 non-null  object
 1   f                                         326571 non-null  object
 2   22                                        284446 non-null  float64
 3   Germany                                   359346 non-null  object
 4   Feb 1, 2007                               359346 non-null  object
dtypes: float64(1), object(4)
memory usage: 13.7+ MB